Enums/ВидыОперацийЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЧекККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиПодключениеРРО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключениеРРО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРРО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТестовыйФН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКЧекамФайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайлаЧеков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Операторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оператор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОтправкаДокументовПРРО/Ext/Module.bsl
//Функция отправляет чек на фискальный регистратор
//В случае успеха возврат Истина
Функция ПровестиДокументПоПРРО(ДокДляОтправки) Экспорт
	
	стрОтвета = Новый Структура;
	стрОтвета.Вставить("Успешно", Ложь);
	стрОтвета.Вставить("ФискальныйНомер");
	стрОтвета.Вставить("Инфо");
	стрОтвета.Вставить("URL");
	
	Если ДокДляОтправки.Оплата[0].ВидОплаты = Справочники.ВидыОплатЧекаККМ.Наличные Тогда
		ВидОплаты = "1";
		НастройкиПодключения = Справочники.НастройкиПодключениеРРО.ПолучитьСтруктуруПодключенияРРО("ВебЧек", ДокДляОтправки.КассаККМ);	
	Иначе
		Если ДокДляОтправки.ДанныеОбОплате.Количество() > 0 Тогда
			ВидОплаты = "2";
		Иначе
			ВидОплаты = "7";
		КонецЕсли;
		КассаККМ			 	= Справочники.КассыККМ.ПолучитьСсылку(Новый УникальныйИдентификатор("746737d7-5931-11ee-bf2c-00155d0a1408")); //касса Вечир
		НастройкиПодключения 	= Справочники.НастройкиПодключениеРРО.ПолучитьСтруктуруПодключенияРРО("ВебЧек", КассаККМ);
	КонецЕсли;
	
	Если НастройкиПодключения = Неопределено Тогда
		Возврат стрОтвета;
	КонецЕсли;
	
	ФН = НастройкиПодключения.ФН;
	
	//Проверим открыта ли смена
	ПараметрыКоманды = Новый Структура("FN", ФН );	
	СтруктураПараметров = ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("GetCurrentStatus",ПараметрыКоманды);				
	Если СтруктураПараметров.Результат Тогда
		//если смена закрыта - открываем
		Если СтруктураПараметров.ВыходныеПараметрыПРРО.ShiftNumber = "0" Тогда
			ВходныеПараметры = Новый Структура("FN, ОператорИД", ФН, НастройкиПодключения.Оператор);
			СтруктураПараметров = ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("OpenShift",ВходныеПараметры);		
			Если НЕ СтруктураПараметров.Результат  Тогда				
				ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Не удалось открыть смену. " + "++++++++++++++++ Ошибка открытия смены ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+") ++++++++++++++++++");	
				стрОтвета.Успешно = Ложь;
				стрОтвета.Инфо = СтруктураПараметров;
				Возврат стрОтвета;	
			иначе
				чекxml = СтруктураПараметров.ВыходныеПараметрыПРРО.ТекстоваяВерсия;			
			КонецЕсли; 	
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТчТовары.Номенклатура.Представление КАК Номенклатура,
	|	ТчТовары.Номенклатура.Код КАК Код,
	|	ТчТовары.Артикул КАК Артикул,
	|	ТчТовары.Штрихкод КАК Штрихкод,
	|	ТчТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТчТовары.ХарактеристикаНоменклатуры.Представление КАК ХарактеристикаНоменклатуры,
	|	ТчТовары.СерияНоменклатуры.Представление КАК СерияНоменклатуры,
	|	ТчТовары.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ТчТовары.Цена КАК Цена,
	|	ТчТовары.Количество КАК Количество,
	|	ТчТовары.Сумма КАК Сумма,
	|	ТчТовары.Цена * ТчТовары.Количество - ТчТовары.Сумма КАК СуммаСкидок,
	|	ВЫБОР
	|		КОГДА ТчТовары.Цена * ТчТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ (1 - ТчТовары.Сумма / (ТчТовары.Цена * ТчТовары.Количество)) * 100
	|	КОНЕЦ КАК ПроцентСкидкиНаценки,
	|	ТчТовары.Номенклатура.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ТчТовары
	|ГДЕ
	|	ТчТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Код,
	|	Товары.Артикул,
	|	Товары.Штрихкод,
	|	Товары.ИдентификаторСтроки,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Цена,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.СуммаСкидок,
	|	Товары.ПроцентСкидкиНаценки,
	|	Товары.СтавкаНДС
	|ИЗ
	|	Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Сумма,
	|	""Електроний платіжний засіб"" КАК ФормаОплаты,
	|	&ВидОплаты КАК ID
	|ИЗ
	|	Товары КАК Товары");
	Запрос.УстановитьПараметр("Ссылка", ДокДляОтправки);
	Запрос.УстановитьПараметр("ВидОплаты", ВидОплаты);
	Рез = Запрос.ВыполнитьПакет();
	
	Выборка = Рез[1].Выбрать();
	ТаблицаОплат  = Рез[2].Выгрузить();
	ТаблицаОплат.Свернуть("ID, ФормаОплаты","Сумма");
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Наименование");
	ТаблицаТоваров.Колонки.Добавить("Код");
	ТаблицаТоваров.Колонки.Добавить("НомерСекции");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Скидка");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДССтрокой");
	ТаблицаТоваров.Колонки.Добавить("ЭтоПодакцизныйТовар");
	ТаблицаТоваров.Колонки.Добавить("СтруктураДопРеквизитовТабличнойЧасти");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНалога");

	Пока Выборка.Следующий() Цикл
		Товар = ТаблицаТоваров.Добавить();
		   
// н ЛИВ		
		//НаименованиеТовара = СокрЛП(Выборка.Номенклатура)
		//   + "(" + СокрЛП(Выборка.ЕдиницаИзмерения)
		//   + ?(ПустаяСтрока(Выборка.ХарактеристикаНоменклатуры), "", ", " + СокрЛП(Выборка.ХарактеристикаНоменклатуры))
		//   + ?(ПустаяСтрока(Выборка.СерияНоменклатуры)         , "", ", " + СокрЛП(Выборка.СерияНоменклатуры)) + ")";
		   
		НаименованиеТовара = СокрЛП(Выборка.Номенклатура)
			+ ?(ПустаяСтрока(Выборка.ХарактеристикаНоменклатуры), "", "(" + СокрЛП(Выборка.ХарактеристикаНоменклатуры) + ")");
// н ЛИВ		
		   
		Товар.Наименование = НаименованиеТовара;
		Товар.Код		   = Выборка.Код;	
		Товар.НомерСекции  = ДокДляОтправки.Склад.НомерСекции;
		Товар.Цена         = Выборка.Цена;
		Товар.Количество   = Выборка.Количество;
		Товар.Скидка       = Выборка.ПроцентСкидкиНаценки;
		Товар.СтавкаНДССтрокой       = Обработки.ТОСервер.ПолучитьСтавкуНДССтрокой(Выборка.СтавкаНДС);
		//Товар.СтавкаНДССтрокой       = Обработки.ТОСервер.ПолучитьСтавкуНДССтрокой(Перечисления.СтавкиНДС.НДС0);
		Товар.Сумма		   = Выборка.Сумма;
		Товар.СтавкаНалога = ?(НастройкиПодключения.БезНДС,"2", "1"); //если Без ндс то отправляем без ндс
		
	КонецЦикла;
	
	НомерЧека=0;
	ВидОперации = ?(ДокДляОтправки.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа, 0, 1);
	
	Если ВидОперации = 1 Тогда //Возврат
		Если ТаблицаТоваров.Итог("Сумма") > 0 Тогда
			ПараметрыКомандыВнесения = Новый Структура ("SumIn",ТаблицаТоваров.Итог("Сумма"));
		иначе
			ПараметрыКомандыВнесения = Новый Структура ("SumOut",-1*ТаблицаТоваров.Итог("Сумма"));
		КонецЕсли;	
		
		ПараметрыКоманды = Новый Структура("FN,ПараметрыКоманды",ФН,ПараметрыКомандыВнесения);
		СтруктураПараметров = ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("CashInOut",ПараметрыКоманды); 
	КонецЕсли;
	
	ПараметрыКоманды = Новый Структура ("FN,Товары,Оплаты,ВидОперации,НомерЧекаВСмене",ФН,ТаблицаТоваров,ТаблицаОплат,ВидОперации,НомерЧека);
	ПараметрыКоманды.Вставить("ДанныеОбОплате", ДокДляОтправки.ДанныеОбОплате.Выгрузить());
	СтруктураПараметров = ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("FiscalReceipt",ПараметрыКоманды); 
	
	
	Если НЕ СтруктураПараметров.Результат  Тогда	
		ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Не удалось пробить чек. " + "++++++++++++++++ Ошибка регистрации чека  ("+СтруктураПараметров.ВыходныеПараметрыПРРО.ErrHelp+")  ++++++++++++++++++");	
		стрОтвета.Успешно = Ложь;
		Возврат стрОтвета;
	иначе
		
		ПараметрыКомандыURL = Новый Структура("TaxNum", СтруктураПараметров.ВыходныеПараметрыПРРО.CheckID);
		ПараметрыКоманды = Новый Структура("FN,ПараметрыКоманды",ФН,ПараметрыКомандыURL);
		стрВозврата = ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("GetCheckCloudurl",ПараметрыКоманды); 
		
		Если стрВозврата.ВыходныеПараметрыПРРО.Свойство("URL") Тогда
			стрОтвета.URL = стрВозврата.ВыходныеПараметрыПРРО.URL;
		КонецЕсли;
		//Отправка чека по viber/sms
		Если НастройкиПодключения.ОтправлятьСообщение Тогда
			
			Заказ = ?(ВидОперации = 0, ДокДляОтправки.ЗаказПокупателя, ДокДляОтправки.ЧекККМПродажа.ЗаказПокупателя);
				
			Если ЗначениеЗаполнено(Заказ)
				И ЗначениеЗаполнено(Заказ.Контрагент) Тогда
				
				НомерТелефона = УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Заказ.Контрагент);
				НомерТелефона = УправлениеКонтактнойИнформацией.ПривестиНомерТелефонаКШаблону(НомерТелефона);
				НомерТелефонаИтог = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(НомерТелефона, "-", ""),"+", ""), "(", ""), ")", ""), " ", "");
				
				Если Лев(НомерТелефона, 1) = "0" Тогда
					НомерТелефонаИтог = "38" + НомерТелефонаИтог;
				ИначеЕсли Лев(НомерТелефона, 1) = "8" Тогда
					НомерТелефонаИтог = "3" + НомерТелефонаИтог;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НомерТелефонаИтог) Тогда
				
				//Отправка смс вайбер Вебчек
				//ПараметрыКоманды = Новый Структура("FN,CheckID,Dest,messagetype", ФН, СтруктураПараметров.ВыходныеПараметрыПРРО.CheckID, НомерТелефонаИтог, 3);
				//стрОтветОтправкиЧековПоВайберуСМС = ВебЧекПРРОСервер.ВыполнитьКомандуПРРОнаСервере("SendMessage",ПараметрыКоманды); 
				//
				//Если НЕ стрОтветОтправкиЧековПоВайберуСМС.Результат Тогда
				//	ЗаписьЖурналаРегистрации("ВебЧек", УровеньЖурналаРегистрации.Ошибка,,,"Не отправить чек по номеру. " + НомерТелефона + "++++++++++++++++ Ошибка Отправки по номеру телефона  ("+стрОтветОтправкиЧековПоВайберуСМС.ВыходныеПараметрыПРРО.ErrHelp+")  ++++++++++++++++++");		
				//КонецЕсли;
				
				//Отправка смс вайбер Турбосмс
				ОтправкаТрубоСМС(ДокДляОтправки, стрОтвета.URL, НомерТелефонаИтог);
				
			КонецЕсли;
			
		КонецЕсли;	
		
		чекxml = СтруктураПараметров.ВыходныеПараметрыПРРО.ТекстоваяВерсия;	
		стрОтвета.Успешно = Истина;
		стрОтвета.ФискальныйНомер = СтруктураПараметров.ВыходныеПараметрыПРРО.CheckID;
		Возврат стрОтвета;
	КонецЕсли;
	
КонецФункции

Процедура ОтправкаТрубоСМС(Чек, URLЧека, НомерТелефона)
	
	Отправитель = "VECHIR";
	Токен = "2766fd681a431e261c60d34c58a5e3c69c3db57a";
	
	Url = "api.turbosms.ua/";
	Viber = "message/send.json";
	
	HTTPСоединение = Новый HTTPСоединение(Url,,,,,60,Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Basic " + Токен);
	Заголовки.Вставить("Content-Type", "application/json");
	
	//file
	URLFile = "file/add.json";
	СтрФайла = Новый Структура;
	СтрФайла.Вставить("url", URLЧека);
	ЗаписьJSON = Новый ЗаписьJSON;            
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтрФайла);            
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	
	HTTPЗапрос = Новый HTTPЗапрос(URLFile, Заголовки);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);	
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗаписьЖурналаРегистрации("Отправка чеков по телефону",,,, ОписаниеОшибки());
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура")
		И СтруктураОтвета.Свойство("response_code") 
		И СтруктураОтвета.response_code = 0 Тогда
		ID = СтруктураОтвета.response_result.id;
	Иначе
		ЗаписьЖурналаРегистрации("Отправка чеков по телефону",УровеньЖурналаРегистрации.Ошибка,,, "Не удалось записать файл в базу турбосмс");
		HTTPСоединение.Удалить(HTTPЗапрос);
		Возврат;
	КонецЕсли;
	
	//viber
	HTTPЗапрос = Новый HTTPЗапрос(Viber, Заголовки);
	
	МассПолучателей = Новый Массив;
	МассПолучателей.Добавить(НомерТелефона);
	
	СтрПараметрыОтправки = Новый Структура;
	СтрПараметрыОтправки.Вставить("recipients", МассПолучателей);

	СтрОтправки = Новый Структура;
	СтрОтправки.Вставить("sender", Константы.АльфаИмя.Получить());
	СтрОтправки.Вставить("text", "Ви отримали чек №" + Чек.ФискальныйНомерЧека+ ", що підтверджує Вашу покупку.");
	СтрОтправки.Вставить("file_id", ID);
	СтрОтправки.Вставить("caption", "Чек");

	СтрПараметрыОтправки.Вставить("viber", СтрОтправки);
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	ЗаписьJSON = Новый ЗаписьJSON;            
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, СтрПараметрыОтправки);            
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);	
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);	
	
	мОтвет 	= Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(мОтвет);
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	Исключение 
		ЗаписьЖурналаРегистрации("Отправка чеков по телефону",УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	ЧтениеJSON.Закрыть();
	
	HTTPСоединение.Удалить(HTTPЗапрос);
	
КонецПроцедуры
